app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = ? LIMIT ?  [["completed", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."completed" = ?  [["completed", 0]]
---
  def index
    @pending_tasks = Task.where(:completed => false)
    @completed_tasks_count = Task.where(:completed => true).count

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Añado una nueva descripción"], ["updated_at", "2020-02-29 12:44:59.673143"], ["id", 15]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2020-02-29 18:46:12.319416"], ["id", 2]]
---
  def mark_as_completed
    @task = Task.find(params[:id])

    @task.update_attributes(:completed => true)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "deadline", "priority") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["description", "testestestest"], ["created_at", "2020-02-29 18:47:55.274711"], ["updated_at", "2020-02-29 18:47:55.274711"], ["deadline", "2020-02-12"], ["priority", 2]]
---
  def create
    @task = Task.new(task_params)

    if @task.save