app/controllers/tasks_controller.rb

  def week
    @week_tasks_pending = Task.where(:author_id => current_user).where(:deadline => Date.today..Date.today + 6).where(:completed => false).count
    @week_tasks_completed = Task.where(:author_id => current_user).where(:deadline => Date.today..Date.today + 6).where(:completed => true).count
    @week_tasks = []

    @week_tasks << Task.where(:author_id => current_user).where(:deadline => Date.today).where(:completed => false)
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "tarea1"], ["description", "tarea"], ["created_at", "2020-02-26 11:21:30.462823"], ["updated_at", "2020-02-26 11:21:30.462823"]]